/*==============================================================================

   プレイヤー管理[lane.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct LANE
{
	D3DXVECTOR2		pos;	//位置
	D3DXVECTOR2     uv;		//UV値
	D3DXVECTOR2		size;	//サイズ

	int		LaneNumber;		//現在のレーン
	float	alpha;

	int		animeIndex;		//アニメーション枚数
	int		animeWait;		//アニメーション
	bool	flag;
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

void	InitLane(void);
void	UninitLane(void);
void	UpdateLane(void);
void	DrawLane(void);
LANE* GetLane(void);


